Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་དང་། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་།
en: They do not train in order to accept or negate the perfections, all the aspects of emptiness, the thirty-seven factors conducive to enlightenment, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, or the eighteen distinct qualities of the buddhas.

source: སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཡོངས་སུ་གཟུང་བ་དང་། མེད་པར་བྱ་བའི་ཕྱིར་མི་སློབ་པོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ཡོངས་སུ་གཟུང་བ་དང་མེད་པར་བྱ་བའི་ཕྱིར་མི་སློབ་བོ།། །།ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ།
en: They do not train in order to accept or negate [all the fruits and realizations], up to and including all-aspect omniscience.”

source: བམ་པོ་སུམ་ཅུ་པ། །དེ་ནས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་རབ་འབྱོར་དེ་ལྟར་སློབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གཟུགས་ཡོངས་སུ་གཟུང་བ་དང་། མེད་པར་བྱ་བའི་ཕྱིར་མི་སློབ་པ་ཡིན་ནམ།
en: Then the venerable Śāradvatīputra asked the venerable Subhūti, “Venerable Subhūti, do bodhisattva great beings who train accordingly not train in order to accept or negate physical forms?

source: ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཡོངས་སུ་གཟུང་བ་དང་། མེད་པར་བྱ་བའི་ཕྱིར་མི་སློབ་པ་ཡིན་ནམ།
en: Do they not train in order to accept or negate feelings, perceptions, formative predispositions, or consciousness?

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ཡོངས་སུ་གཟུང་བ་དང་། མེད་པར་བྱ་བའི་ཕྱིར་མི་སློབ་པ་ཡིན་ནམ།
en: Do they not train in order to accept or negate [all the attributes and fruits], up to and including all-aspect omniscience?” “

source: རབ་འབྱོར་གྱིས་སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་སློབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་གཟུགས་ཡོངས་སུ་གཟུང་བ་དང་། མེད་པར་བྱ་བའི་ཕྱིར་མི་སློབ་བོ།
en: Venerable Śāradvatīputra,” replied Subhūti, “bodhisattva great beings who train accordingly do not train in order to accept or negate physical forms.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་ཡོངས་སུ་གཟུང་བ་དང་མེད་པར་བྱ་བའི་ཕྱིར་མི་སློབ་བོ།
en: They do not train in order to accept or negate feelings, perceptions, formative predispositions, or consciousness.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ཡོངས་སུ་གཟུང་བ་དང་། མེད་པར་བྱ་བའི་ཕྱིར་མི་སློབ་བོ།། །།
en: They do not train in order to accept or negate [all the attributes and fruits], up to and including all-aspect omniscience.” “

source: སྨྲས་པ་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཅིའི་ཕྱིར་ན་གཟུགས་ཡོངས་སུ་གཟུང་བ་དང་མེད་པར་བྱ་བའི་ཕྱིར་མི་སློབ་པ་ཡིན།
en: Venerable Subhūti,” he asked, “why do bodhisattva great beings not train in order to accept or negate physical forms?

source: ཅིའི་ཕྱིར་ན་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཡོངས་སུ་གཟུང་བ་དང་། མེད་པར་བྱ་བའི་ཕྱིར་མི་སློབ་པ་ཡིན།
en: Why do they not train in order to accept or negate feelings, perceptions, formative predispositions, or consciousness?

source: ཅིའི་ཕྱིར་ན་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ཡོངས་སུ་བཟུང་བ་དང་། མེད་པར་བྱ་བའི་ཕྱིར་མི་སློབ་པ་ཡིན།
en: Why do they not train in order to accept or negate [all attributes and fruits], up to and including all-aspect omniscience?” “

source: རབ་འབྱོར་གྱིས་སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་ནི་འདི་ལྟར་གཟུགས་ལ་ཡོངས་སུ་འཛིན་པ་མེད་དེ།
en: Venerable Śāradvatīputra,” replied Subhūti, “it is because there is no acceptance of physical forms.

source: ཕྱི་ནང་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་གཟུགས་ལ་གཟུགས་ཡོངས་སུ་མི་འཛིན་ཏོ།
en: That is to say, there is no acceptance of physical forms as physical forms, owing to the emptiness of external and internal phenomena.

source: །དེ་ནི་འདི་ལྟར་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ལ་ཡོངས་སུ་འཛིན་པ་མེད་དེ།
en: It is because there is no acceptance of feelings, perceptions, formative predispositions, or consciousness.

source: ཕྱི་ནང་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་རྣམ་པར་ཤེས་པ་ལ་རྣམ་པར་ཤེས་པ་ཡོངས་སུ་མི་འཛིན་ཏོ།
en: That is to say, there is no acceptance of consciousness [and so forth] as consciousness [and so forth], owing to the emptiness of external and internal phenomena. {Ki.

source: །དེ་ནི་འདི་ལྟར་སྐྱེ་མཆེད་དང་། ཁམས་དང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཡོངས་སུ་འཛིན་པ་མེད་དེ།
en: II-III: 26} It is because there is no acceptance of the sense fields, the sensory elements, or the links of dependent origination.

source: ཕྱི་ནང་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ལ་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ཡོངས་སུ་མི་འཛིན་ཏོ། །དེ་ནི་འདི་ལྟར་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་དང་། འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མྱེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་རྣམས་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་།
en: That is to say, there is no acceptance of the links of dependent origination [and so forth] as the links of dependent origination [and so forth], owing to the emptiness of external and internal phenomena.

source: སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་དང་། མི་འཇིགས་པ་རྣམས་དང་།
en: It is because there is no acceptance of the perfections, all the aspects of emptiness, the factors conducive to enlightenment, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, or the distinct qualities of the buddhas.

source: སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཡོངས་སུ་འཛིན་པ་མེད་དེ། ཕྱི་ནང་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ལ། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཡོངས་སུ་མི་འཛིན་ཏོ།
en: That is to say, there is no acceptance of the distinct qualities of the buddhas [and so forth] as the distinct qualities of the buddhas [and so forth], owing to the emptiness of external and internal phenomena.

source: །དེ་ནི་འདི་ལྟར་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ལ་ཡོངས་སུ་འཛིན་པ་མེད་དེ།
en: It is because there is no acceptance of [the fruits and realizations], up to and including all-aspect omniscience.

source: ཕྱི་ནང་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ།
en: That is to say, there is no acceptance of all-aspect omniscience [and so forth] as all-aspect omniscience [and so forth], owing to the emptiness of external and internal phenomena.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡོངས་སུ་མི་འཛིན་ཏོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་ན།
en: Venerable Śāradvatīputra, so it is that they will be emancipated in all-aspect omniscience through the nonacceptance of all phenomena.” “

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཐམས་ཅད་ལ་ཡོངས་སུ་འཛིན་པ་མེད་པའི་ཚུལ་གྱིས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འབྱུང་ངོ་། །སྨྲས་པ་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་དེ་ལྟར་སློབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབས་ཤིང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འབྱུང་བ་ཡིན་ནམ།
en: Venerable Subhūti,” he asked, “will bodhisattva great beings who train in this manner train in the perfection of wisdom and be emancipated in all-aspect omniscience, owing to the nonacceptance of all phenomena?” “

source: རབ་འབྱོར་གྱིས་སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་སློབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབས་ཤིང་། ཆོས་ཐམས་ཅད་ལ་ཡོངས་སུ་འཛིན་པ་མེད་པའི་ཚུལ་གྱིས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འབྱུང་ངོ་།
en: Venerable Śāradvatīputra,” replied Subhūti, “bodhisattva great beings who train in this manner will train in the perfection of wisdom and be emancipated in all-aspect omniscience, owing to the nonacceptance of all phenomena.” “

source: །སྨྲས་པ་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་དེ་ལྟར་སློབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཐམས་ཅད་ཡོངས་སུ་གཟུང་བ་དང་། མེད་པར་བྱ་བའི་ཕྱིར་བསླབས་ཤིང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཇི་ལྟར་འབྱུང་བར་འགྱུར། རབ་འབྱོར་གྱིས་སྨྲས་པ།
en: Venerable Subhūti,” he asked, “how will bodhisattva great beings who train in this manner train in it and be emancipated in all-aspect omniscience, owing to the nonacceptance of all phenomena?” “

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་པུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། གཟུགས་ཀྱི་སྐྱེ་བ་མི་མཐོང་། འགག་པ་དང་། བླང་བ་དང་དོར་བ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་དང་། རྣམ་པར་བྱང་བ་དང་། སོགས་པ་དང་།
en: Venerable Śāradvatīputra,” replied Subhūti, “in this regard, when bodhisattva great beings practice the perfection of wisdom, they do not observe the arising of physical forms, nor do they observe their cessation, appropriation, rejection, affliction, purification, accumulation, diminishing, decrease, or increase.

source: འབྲི་བ་དང་། འགྲིབ་པ་དང་། འཕེལ་བ་མི་མཐོང་སྟེ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་གཟུགས་གཟུགས་ཀྱི་རང་བཞིན་གྱིས་མེད་ཅིང་མི་དམིགས་སོ།
en: If you ask why, it is because physical forms do not exist and are not apprehended, owing to the intrinsic nature of physical forms.

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པའི་སྐྱེ་བ་མི་མཐོང་འགག་པ་དང་། བླང་བ་དང་། དོར་བ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་དང་། རྣམ་པར་བྱང་བ་དང་། སོགས་པ་དང་། འབྲི་བ་དང་། འགྲིབ་པ་དང་། འཕེལ་བ་མི་མཐོང་སྟེ།
en: They do not observe the arising of feelings, perceptions, formative predispositions, or consciousness, nor do they observe their cessation, appropriation, rejection, affliction, purification, accumulation, diminishing, decrease, or increase.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་རྣམ་པར་ཤེས་པ་རྣམ་པར་ཤེས་པའི་རང་བཞིན་གྱིས་མེད་ཅིང་མི་དམིགས་སོ། །སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་དང་།
en: If you ask why, it is because consciousness [and so forth] do not exist and are not apprehended, owing to the intrinsic nature of consciousness [and so forth].

source: ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་དང་། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མྱེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་དང་།
en: They do not observe the arising of the sense fields, the sensory elements, the links of dependent origination, the perfections, all the aspects of emptiness, the thirty-seven factors conducive to enlightenment, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, {Ki.

source: མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་གྱི་སྐྱེ་བ་མི་མཐོང་། འགག་པ་དང་། བླང་བ་དང་། དོར་བ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་དང་། རྣམ་པར་བྱང་བ་དང་།
en: II-III: 27} the fearlessnesses, the kinds of exact knowledge, the distinct qualities of the buddhas, or [all fruits and realizations], up to and including all-aspect omniscience, nor do they observe their cessation, appropriation, rejection, affliction, purification, accumulation, diminishing, decrease, or increase.

source: སོགས་པ་དང་། འབྲི་བ་དང་འགྲིབ་པ་དང་། འཕེལ་བ་མི་མཐོང་སྟེ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རང་བཞིན་གྱིས་མེད་ཅིང་མི་དམིགས་སོ།
en: If you ask why, it is because all-aspect omniscience [and so forth] do not exist and are not apprehended, owing to the intrinsic nature of all-aspect omniscience [and so forth].

source: །ཚེ་དང་ལྡན་པ་ཤར་དྭ་ཏིའི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཐམས་ཅད་སྐྱེ་བ་མེད་པ་དང་། འགག་པ་མེད་པ་དང་། བླང་བ་མེད་པ་དང་། དོར་བ་མེད་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་། རྣམ་པར་བྱང་བ་མེད་པ་དང་། སོགས་པ་མེད་པ་དང་། འབྲི་བ་མེད་པ་དང་། འགྲིབ་པ་མེད་པ་དང་། འཕེལ་བ་མེད་པའི་ཕྱིར་མི་སློབ།
en: Venerable Śāradvatīputra, so it is that bodhisattva great beings train in the perfection of wisdom and are emancipated in all-aspect omniscience through the nonarising, noncessation, nonappropriation, nonrejection, nonaffliction, nonpurification, nonaccumulation, nondiminishing, nondecrease, and nonincrease of all phenomena.”

source: མི་འབྱུང་བའི་ཚུལ་གྱིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབས་ཤིང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འབྱུང་ངོ་། །དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བཙུན་པ་ཤར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་གང་ནས་བཙལ་བར་བྱ།
en: Then Śakra, mighty lord of the gods, asked the venerable Śāradvatīputra, “Venerable Śāradvatīputra, where should one search for the bodhisattva great beings’ perfection of wisdom?” “

source: ཤ་ར་དྭ་ཏིའི་བུས་སྨྲས་པ། ལྷའི་དབང་པོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི། རབ་འབྱོར་གྱི་ལེའུ་ལས་བཙལ་བར་བྱའོ།
en: Mighty lord of the gods, one should seek the bodhisattva great beings’ perfection of wisdom in the discourse of Subhūti,” replied Śāradvatīputra.

source: །དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བཙུན་པ་རབ་འབྱོར་འཕགས་པ་ཤ་ར་དྭ་ཏིའི་བུས་འདི་སྐད་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་རབ་འབྱོར་གྱི་ལེའུ་ལས་བཙལ་བར་བྱའོ་ཞེས་སྨྲས་ཏེ།
en: Then Śakra, mighty lord of the gods, said to the venerable Subhūti, “The noble Śāradvatīputra has said that one should seek the perfection of wisdom that bodhisattva great beings have in the discourse of Subhūti.

source: དེ་ནི་ཁྱོད་ཀྱི་མཐུའོ། །ཁྱོད་ཀྱི་བྱིན་གྱིས་བརླབས་སོ།
en: Is this through your power, through your blessing?” “

source: །རབ་འབྱོར་གྱིས་སྨྲས་པ། ཀཽ་ཤི་ཀ་འདི་ནི་བདག་གི་མཐུ་མ་ཡིན།
en: Kauśika,” replied Subhūti, “it is not through my power.

source: འདི་ནི་བདག་གི་བྱིན་གྱིས་བརླབས་མ་ཡིན་ནོ།
en: It is not through my blessing.”

source: །བརྒྱ་བྱིན་གྱིས་སྨྲས་པ་བཙུན་པ་རབ་འབྱོར་འོ་ན་དེ་སུའི་མཐུ། དེ་སུའི་བྱིན་གྱིས་བརླབས།
en: Śakra asked, “Blessed Subhūti, in that case, whose power is it, and whose blessing is it?” “

source: རབ་འབྱོར་གྱིས་སྨྲས་པ། ཀཽ་ཤི་ཀ་དེ་ནི་དེ་བཞིན་གཤེགས་པའི་མཐུའོ།
en: Kauśika,” replied Subhūti, “it is the power of the tathāgatas.

source: །དེ་ནི་དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱིས་བརླབས་སོ།
en: It is the blessing of the tathāgatas.”

source: །བརྒྱ་བྱིན་གྱིས་སྨྲས་པ། བཙུན་པ་རབ་འབྱོར་ཆོས་ཐམས་ཅད་བྱིན་གྱིས་བརླབས་མེད་ན། ཅིའི་ཕྱིར་དེ་སྐད་དུ། འདི་ནི་དེ་བཞིན་གཤེགས་པའི་མཐུའོ། །འདི་ནི་དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱིས་བརླབས་སོ།
en: Śakra then asked, “Blessed Subhūti, if all phenomena are without blessing, how can it be said that this is the power of the tathāgatas, this is the blessing of the tathāgatas?

source: །ཞེས་སྨྲ་བྱིན་གྱིས་བརླབས་མེད་པའི་ཆོས་ཉིད་ལས་གུད་ན་ཡང་དེ་བཞིན་གཤེགས་པ་མི་དམིགས་ལ།
en: The tathāgatas are nonapprehensible apart from reality that is devoid of blessings.

source: དེ་བཞིན་ཉིད་ལས་གུད་ན་ཡང་དེ་བཞིན་གཤེགས་པ་ཡོད་པར་མི་དམིགས་སོ།
en: The existence of the tathāgatas is nonapprehensible apart from the real nature.” “

source: །རབ་འབྱོར་གྱིས་སྨྲས་པ། ཀཽ་ཤི་ཀ་དེ་དེ་བཞིན་ནོ། །དེ་དེ་བཞིན་ཏེ།
en: Kauśika, it is so! It is so!” replied Subhūti. “

source: བྱིན་གྱིས་བརླབས་མེད་པའི་ཆོས་ཉིད་ལས་གུད་ན་ཡང་དེ་བཞིན་གཤེགས་པ་ཡོད་པར་མི་དམིགས་ལ།
en: The existence of the tathāgatas is not apprehensible apart from reality that is devoid of blessings.

source: །བྱིན་གྱིས་བརླབས་མེད་པའི་ཆོས་ཉིད་ལ་ཡང་དེ་བཞིན་གཤེགས་པ་མི་དམིགས་ལ།
en: The tathāgatas are not apprehensible in reality that is devoid of blessings.

source: དེ་བཞིན་གཤེགས་པ་ལ་ཡང་བྱིན་གྱིས་བརླབས་མེད་པའི་ཆོས་མི་དམིགས་སོ།
en: Nor indeed is reality devoid of blessings apprehensible in the tathāgatas.

source: །དེ་བཞིན་ཉིད་ལ་ཡང་དེ་བཞིན་གཤེགས་པ་མི་དམིགས་སོ།
en: The tathāgatas are not apprehensible in the real nature.

source: །དེ་བཞིན་གཤེགས་པ་ལ་ཡང་དེ་བཞིན་ཉིད་མི་དམིགས་སོ།
en: Nor indeed is the real nature apprehensible in the tathāgatas. “

source: །གཟུགས་ཀྱི་དེ་བཞིན་ཉིད་ལ་ཡང་དེ་བཞིན་གཤེགས་པ་མི་དམིགས་སོ།
en: The tathāgatas are not apprehensible in the real nature of physical forms.

source: །དེ་བཞིན་གཤེགས་པ་ལ་ཡང་གཟུགས་ཀྱི་དེ་བཞིན་ཉིད་མི་དམིགས་སོ།
en: Nor indeed is the real nature of physical forms apprehensible in the tathāgatas.

source: །གཟུགས་ཀྱི་ཆོས་ཉིད་ལ་ཡང་དེ་བཞིན་གཤེགས་པ་མི་དམིགས་སོ།
en: The tathāgatas are not apprehensible in the reality of physical forms.

source: །དེ་བཞིན་གཤེགས་པ་ལ་ཡང་གཟུགས་ཀྱི་ཆོས་ཉིད་མི་དམིགས་སོ།
en: Nor indeed is the reality of physical forms apprehensible in the tathāgatas. “

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པའི་དེ་བཞིན་ཉིད་ལ་ཡང་དེ་བཞིན་གཤེགས་པ་མི་དམིགས་སོ།
en: The tathāgatas are not apprehensible in the real nature of feelings, perceptions, formative predispositions, or consciousness. {

source: །དེ་བཞིན་གཤེགས་པ་ལ་ཡང་རྣམ་པར་ཤེས་པའི་དེ་བཞིན་ཉིད་མི་དམིགས་སོ།
en: Ki.II-III: 28} Nor indeed is the real nature of consciousness [and so forth] apprehensible in the tathāgatas.

source: །རྣམ་པར་ཤེས་པའི་ཆོས་ཉིད་ལ་ཡང་དེ་བཞིན་གཤེགས་པ་མི་དམིགས་སོ།
en: The tathāgatas are not apprehensible in the reality of consciousness [and so forth].

source: །དེ་བཞིན་གཤེགས་པ་ལ་ཡང་རྣམ་པར་ཤེས་པའི་ཆོས་ཉིད་མི་དམིགས་སོ། །སྐྱེ་མཆེད་དང་། །ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་དང་། ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་དང་།
en: Nor indeed is the reality of consciousness [and so forth] apprehensible in the tathāgatas. “

source: སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་དང་། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་།
en: The tathāgatas are not apprehensible in the real nature of the sense fields, the sensory elements, the links of dependent origination, the perfections, all the aspects of emptiness, the thirty-seven factors conducive to enlightenment, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, the distinct qualities of the buddhas, or [any of the fruits and realizations], up to and including all-aspect omniscience.

source: སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་གྱི་དེ་བཞིན་ཉིད་ལ་ཡང་དེ་བཞིན་གཤེགས་པ་མི་དམིགས་སོ།
en: Nor indeed is the real nature of all-aspect omniscience [and so forth] apprehensible in the tathāgatas.

source: །དེ་བཞིན་གཤེགས་པ་ལ་ཡང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་དེ་བཞིན་ཉིད་མི་དམིགས་སོ།
en: The tathāgatas are not apprehensible in the reality of all-aspect omniscience [and so forth].

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཆོས་ཉིད་ལ་ཡང་དེ་བཞིན་གཤེགས་པ་མི་དམིགས་སོ།
en: Nor indeed is the reality of all-aspect omniscience [and so forth] apprehensible in the tathāgatas. “

source: །དེ་བཞིན་གཤེགས་པ་ལ་ཡང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཆོས་ཉིད་མི་དམིགས་སོ། །ཀཽ་ཤི་ཀ་དེ་བཞིན་གཤེགས་པ་གང་ཡིན་པ་དེ་ནི་གཟུགས་ཀྱི་དེ་བཞིན་ཉིད་དང་ལྡན་པ་ཡང་མ་ཡིན་བྲལ་བ་ཡང་མ་ཡིན་ནོ།
en: Kauśika, that which is a tathāgata is neither conjoined with nor disjoined from the real nature of physical forms.

source: །གཟུགས་ཀྱི་ཆོས་ཉིད་དང་ལྡན་པ་ཡང་མ་ཡིན་བྲལ་བ་ཡང་མ་ཡིན་ནོ།
en: It is neither conjoined with nor disjoined from the reality of physical forms.

source: །གཟུགས་ཀྱི་དེ་བཞིན་ཉིད་མ་ཡིན་པ་གཞན་དང་ལྡན་པ་ཡང་མ་ཡིན་བྲལ་བ་ཡང་མ་ཡིན་ནོ།
en: It is neither conjoined with nor disjoined from anything other than the real nature of physical forms.

source: །གཟུགས་ཀྱི་ཆོས་ཉིད་མ་ཡིན་པ་གཞན་དང་ལྡན་པ་ཡང་མ་ཡིན། བྲལ་བ་ཡང་མ་ཡིན་ནོ།
en: It is neither conjoined with nor disjoined from anything other than the reality of physical forms. “

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པའི་དེ་བཞིན་ཉིད་དང་ལྡན་པ་ཡང་མ་ཡིན་བྲལ་བ་ཡང་མ་ཡིན་ནོ།
en: It is neither conjoined with nor disjoined from the real nature of feelings, perceptions, formative predispositions, or consciousness.

source: །རྣམ་པར་ཤེས་པའི་ཆོས་ཉིད་དང་ལྡན་པ་ཡང་མ་ཡིན་བྲལ་བ་ཡང་མ་ཡིན་ནོ།
en: It is neither conjoined with nor disjoined from the reality of consciousness [and so forth].

source: །རྣམ་པར་ཤེས་པའི་དེ་བཞིན་ཉིད་མ་ཡིན་པ་གཞན་དང་ལྡན་པ་ཡང་མ་ཡིན་བྲལ་བ་ཡང་མ་ཡིན་ནོ།
en: It is neither conjoined with nor disjoined from anything other than the real nature of consciousness [and so forth].

source: །རྣམ་པར་ཤེས་པའི་ཆོས་ཉིད་མ་ཡིན་པ་གཞན་དང་ལྡན་པ་ཡང་མ་ཡིན་བྲལ་བ་ཡང་མ་ཡིན་ནོ།
en: It is neither conjoined with nor disjoined from anything other than the reality of consciousness [and so forth]. “

source: །ཀཽ་ཤི་ཀ་དེ་བཞིན་གཤེགས་པ་གང་ཡིན་པ་དེ་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་གྱི་དེ་བཞིན་ཉིད་དང་ལྡན་པ་ཡང་མ་ཡིན་བྲལ་བ་ཡང་མ་ཡིན་ནོ།
en: Kauśika, that which is a tathāgata is neither conjoined with nor disjoined from the real nature of [all the attributes, fruits, and realizations], up to and including all-aspect omniscience.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཆོས་ཉིད་དང་ལྡན་པ་ཡང་མ་ཡིན་བྲལ་བ་ཡང་མ་ཡིན་ནོ།
en: It is neither conjoined with nor disjoined from the reality of all-aspect omniscience [and so forth].

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་དེ་བཞིན་ཉིད་མ་ཡིན་པ་གཞན་དང་ལྡན་པ་ཡང་མ་ཡིན་བྲལ་བ་ཡང་མ་ཡིན་ནོ།
en: It is neither conjoined with nor disjoined from anything other than the real nature of all-aspect omniscience [and so forth].

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཆོས་ཉིད་མ་ཡིན་པ་གཞན་དང་ལྡན་པ་ཡང་མ་ཡིན་བྲལ་བ་ཡང་མ་ཡིན་ནོ།
en: It is neither conjoined with nor disjoined from anything other than the reality of all-aspect omniscience [and so forth].

source: །ཀཽ་ཤི་ཀ་འདི་ནི་གང་ཆོས་འདི་དག་ཐམས་ཅད་དང་ལྡན་པ་ཡང་མ་ཡིན་བྲལ་བ་ཡང་མ་ཡིན་པ་དེའི་མཐུ་སྟེ།
en: Kauśika, this is the power of those who are neither conjoined with nor disjoined from all those phenomena.

source: བྱིན་གྱིས་བརླབས་མེད་པའི་ཚུལ་གྱིས་དེའི་བྱིན་གྱིས་བརླབས་སོ།
en: This is their blessing inasmuch as they are devoid of blessing. “

source: །ཀཽ་ཤི་ཀ་གང་ཡང་འདི་སྐད་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་གང་ནས་བཙལ་བར་བྱ་ཞེས་ཟེར་བ་ནི།
en: Kauśika, you asked where bodhisattva great beings should seek the perfection of wisdom.

source: ཀཽ་ཤི་ཀ་གཟུགས་ལས་ཀྱང་བཙལ་བར་མི་བྱ།
en: Kauśika, they should not seek it in physical forms.

source: གཟུགས་ལས་གཞན་དུ་ཡང་བཙལ་བར་མི་བྱའོ།
en: They should not seek it in anything other than physical forms.

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ལས་ཀྱང་བཙལ་བར་མི་བྱ།
en: They should not seek it in feelings, perceptions, formative predispositions, or consciousness.

source: རྣམ་པར་ཤེས་པ་ལས་གཞན་དུ་ཡང་བཙལ་བར་མི་བྱའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཀཽ་ཤི་ཀ་དེ་ནི་འདི་ལྟར་གཟུགས་གང་ཡིན་པ་དང་། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་གང་ཡིན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་གང་ཡིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་གང་ཡིན་པ་དང་།
en: They should not seek it in anything other than consciousness [and so forth].
